{
  "irVersion": "0.1a",
  "id": "unknown-field",
  "title": "Unknown Field",
  "kind": "dataflow",
  "direction": "left-to-right",
  "nodes": [],
  "edges": [],
  "metadata": {},
  "layout": "ranked"
}
